tsung-yzq.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
	<clients>
    	<client host="localhost" use_controller_vm="true" maxusers='15000'/>
	</clients>

  <!-- Server side setup -->
	<servers>
    	<server host="moneysaved-load-test-yzq.i9d9cwmss2.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  	</servers>

    <load>
    	<arrivalphase phase="1" duration="10" unit="second">
      		<users arrivalrate="1" unit="second"></users>
    	</arrivalphase>
  		<arrivalphase phase="2" duration="10" unit="second">
      		<users arrivalrate="2" unit="second"></users>
    	</arrivalphase>
    	<arrivalphase phase="3" duration="10" unit="second">
      		<users arrivalrate="4" unit="second"></users>
    	</arrivalphase>
    	<arrivalphase phase="4" duration="10" unit="second">
      		<users arrivalrate="8" unit="second"></users>
    	</arrivalphase>
    	<arrivalphase phase="5" duration="10" unit="second">
      		<users arrivalrate="16" unit="second"></users>
    	</arrivalphase>
  	</load>


  	<options>
    <!-- Set connection timeout to 2 seconds -->
    	<option name="global_ack_timeout" value="2000"></option>

    	<option type="ts_http" name="user_agent">
    		<user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    	</option>
  	</options>

  	<sessions>

      <!-- user-flow-3 -->
    	<session name="user-flow-3" probability="25" type="ts_http">
    		
    		<!-- visit the home page -->
  	     <request>
            <http url="/" version='1.1' method='GET'></http>
  		    </request>
	
			   <thinktime value="2" random="true"></thinktime>

        <request>
            <dyn_variable name="authenticity_token"></dyn_variable>
            <http url="/login" version='1.1' method='GET'></http>
        </request>

        <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
        <var name="authenticity_token" />
        </setdynvars>

        <setdynvars sourcetype="random_number" start="1" end="1000">
          <var name="rnd_user" />
       </setdynvars>

        <request subst="true">
            <http url="/login" 
                  version='1.1' 
                  method='POST' 
                  contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;session%5Bemail%5D=test%%_rnd_user%%%40test.com&amp;session%5Bpassword%5D=123456&amp;session%5Bremember_me%5D=0&amp;commit=Log+in" 
                  content_type="application/x-www-form-urlencoded"></http>
        </request>

        <!-- random choose a category -->
        <thinktime value="2" random="true"></thinktime>

			 <setdynvars sourcetype="random_number" start="1" end="5">
  				<var name="rnd_category" />
			 </setdynvars>

			   <request subst="true">
        		<http url="/categories/%%_rnd_category%%" version='1.1' method='GET'></http>
    		</request>

    		<!-- view deals and click on a random deal to check the deal detail -->
			 <thinktime value="2" random="true"></thinktime>

			 <setdynvars sourcetype="random_number" start="1" end="20000">
  				<var name="rnd_deal" />
			 </setdynvars>

			 <request subst="true">
            <dyn_variable name="authenticity_token"></dyn_variable>
        		<http url="/deals/%%_rnd_deal%%" version='1.1' method='GET'></http>
    	 </request>

        <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
        <var name="authenticity_token" />
        </setdynvars>

       <!-- like the deal-->
       <request subst="true">
            <http url="/likes" 
                  version='1.1' 
                  method='POST' 
                  contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;like%5Bdeal_id%5D=%%_rnd_deal%%&amp;button=" 
                  content_type="application/x-www-form-urlencoded"></http>
        </request>

    		<!-- check the ranking page -->
    		<thinktime value="2" random="true"></thinktime>

    		<request>
        		<http url="/rank/show" version='1.1' method='GET'></http>
    		</request>

	    </session>
      <!-- end -->

      <!-- user-flow-1 -->
      <session name="user-flow-1" probability="25" type="ts_http">
        
        <!-- visit the home page -->
         <request>
            <http url="/" version='1.1' method='GET'></http>
          </request>
  
         <thinktime value="2" random="true"></thinktime>

        <request>
            <dyn_variable name="authenticity_token"></dyn_variable>
            <http url="/login" version='1.1' method='GET'></http>
        </request>

        <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
        <var name="authenticity_token" />
        </setdynvars>

        <setdynvars sourcetype="random_number" start="1" end="1000">
          <var name="rnd_user" />
       </setdynvars>

        <request subst="true">
            <http url="/login" 
                  version='1.1' 
                  method='POST' 
                  contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;session%5Bemail%5D=test%%_rnd_user%%%40test.com&amp;session%5Bpassword%5D=123456&amp;session%5Bremember_me%5D=0&amp;commit=Log+in" 
                  content_type="application/x-www-form-urlencoded"></http>
        </request>

        <!-- view profile page -->
        <thinktime value="2" random="true"></thinktime>
 
         <request subst="true">
            <http url="/users/%%_rnd_user%%" version='1.1' method='GET'></http>
        </request>

        <!-- check one random liked deal -->
       <thinktime value="2" random="true"></thinktime>

       <setdynvars sourcetype="random_number" start="1" end="1000">
          <var name="rnd_liked_deal" />
       </setdynvars>

       <request subst="true"> 
            <http url="/deals/%%_rnd_liked_deal%%" version='1.1' method='GET'></http>
       </request> 
       
        <!-- do a search -->
        <thinktime value="2" random="true"></thinktime>

        <setdynvars sourcetype="random_string" length="17">
          <var name="rnd_deal_name" />
       </setdynvars> 
       
        <request subst = "true">
            <http url='/search/show?utf8=%E2%9C%93&amp;search=%%_rnd_deal_name%%&amp;button=' version='1.1' method='POST' ></http>
        </request> 
        
      </session>
      

      <!-- user-flow-5 -->
      <session name="user-flow-5" probability="15" type="ts_http">
        
        <!-- visit the home page -->
         <request>
            <http url="/" version='1.1' method='GET'></http>
          </request>

         <!-- go to sign up -->
         <thinktime value="2" random="true"></thinktime>

        <request>
            <dyn_variable name="authenticity_token"></dyn_variable>
            <http url="/users/new" version='1.1' method='GET'></http>
        </request>

        <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
        <var name="authenticity_token" />
        </setdynvars>

        <setdynvars sourcetype="random_string" length="8">
          <var name="rnd_user_email" />
       </setdynvars>
       <setdynvars sourcetype="random_string" length="10">
          <var name="rnd_user_name" />
       </setdynvars>

        <request subst="true">
            <http url="/user/new" 
                  version='1.1' 
                  method='POST' 
                  contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;
                  user%5Bname%5D=%%_rnd_user_name%%
                  user%5Bemail%5D=%%_rnd_user_email%%%40test.com&amp;user%5Bpassword%5D=123456&amp;
                  user%5Bpassword_confirmation%5D=123456&amp;
                  commit=Create+my+account" 
                  content_type="application/x-www-form-urlencoded"></http>
        </request>

        <!-- view random deal detail page -->
        <thinktime value="2" random="true"></thinktime>
        <request>
            <http url="/" version='1.1' method='GET'></http>
          </request>

        <setdynvars sourcetype="random_number" start="1" end="20000">
          <var name="rnd_deal" />
        </setdynvars>

         <request subst="true">
            <http url="/deals/%%_rnd_deal%%" version='1.1' method='GET'></http>
        </request>

        <!-- like deal -->
       <thinktime value="2" random="true"></thinktime>

       <request subst="true">
            <http url="/likes" 
                  version='1.1' 
                  method='POST' 
                  contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;like%5Bdeal_id%5D=%%_rnd_deal%%&amp;button=" 
                  content_type="application/x-www-form-urlencoded"></http>
        </request>

        <!-- do a search -->
        <thinktime value="2" random="true"></thinktime>

        <setdynvars sourcetype="random_string" length="2">
          <var name="rnd_deal_name" />
       </setdynvars>
 
        <request subst = "true">
            <http url='/search/show?utf8=%E2%9C%93&amp;search=%%_rnd_deal_name%%&amp;button=' version='1.1' method='POST' ></http>
        </request> 
        
      </session>
      <!-- end -->

      <!-- user-flow-4 -->
      <session name="user-flow-4" probability="10" type="ts_http">
          <!-- visit the home page -->
          <request>
            <http url="/" version='1.1' method='GET'></http>
          </request>

         <thinktime value="2" random="true"></thinktime>

          <!-- random choose a category -->
          <thinktime value="2" random="true"></thinktime>

          <setdynvars sourcetype="random_number" start="1" end="5">
            <var name="rnd_category" />
          </setdynvars>

          <request subst="true">
            <http url="/categories/%%_rnd_category%%" version='1.1' method='GET'></http>
          </request>
          
          <!-- view deals and click on a random deal to check the deal detail -->
           <thinktime value="2" random="true"></thinktime>

            <setdynvars sourcetype="random_number" start="1" end="20000">
              <var name="rnd_deal" />
            </setdynvars>

            <request subst="true">
              <http url="/deals/%%_rnd_deal%%" version='1.1' method='GET'></http>
            </request>

            <!-- check the rank page -->
            <thinktime value="2" random="true"></thinktime>

            <request>
              <http url="/rank/show" version='1.1' method='GET'></http>
            </request>

            <!-- do a search -->
            <thinktime value="2" random="true"></thinktime>

            <setdynvars sourcetype="random_string" length="2">
              <var name="rnd_deal_name" />
            </setdynvars>
 
            <request subst = "true">
              <http url='/search/show?utf8=%E2%9C%93&amp;search=%%_rnd_deal_name%%&amp;button=' version='1.1' method='POST' ></http>
            </request> 

      </session>
      <!-- end -->

      <!-- user-flow-2 -->
      <session name="user-flow-2" probability="25" type="ts_http">
        <!-- visit the home page -->
         <request>
            <http url="/" version='1.1' method='GET'></http>
          </request>
  
         <thinktime value="2" random="true"></thinktime>

        <request>
            <dyn_variable name="authenticity_token"></dyn_variable>
            <http url="/login" version='1.1' method='GET'></http>
        </request>

        <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
        <var name="authenticity_token" />
        </setdynvars>

        <setdynvars sourcetype="random_number" start="1" end="1000">
          <var name="rnd_user" />
       </setdynvars>

        <request subst="true">
            <http url="/login" 
                  version='1.1' 
                  method='POST' 
                  contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;session%5Bemail%5D=test%%_rnd_user%%%40test.com&amp;session%5Bpassword%5D=123456&amp;session%5Bremember_me%5D=0&amp;commit=Log+in" 
                  content_type="application/x-www-form-urlencoded"></http>
        </request>

        <!-- view deals and click on a random deal to check the deal detail -->
       <thinktime value="2" random="true"></thinktime>

       <setdynvars sourcetype="random_number" start="1" end="20000">
          <var name="rnd_deal" />
       </setdynvars>

       <request subst="true">
            <http url="/deals/%%_rnd_deal%%" version='1.1' method='GET'></http>
       </request>

        <!-- go to the order page and make an order-->
        <thinktime value="2" random="true"></thinktime>

        <request subst="true">
            <dyn_variable name="authenticity_token"></dyn_variable>
            <http url="orders/new?utf8=%E2%9C%93&amp;deal_id=%%_rnd_deal%%&amp;button=" version='1.1' method='GET'></http>
        </request>

        <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
        <var name="authenticity_token" />
        </setdynvars>


        <setdynvars sourcetype="random_string" length="15">
          <var name="rnd_order_no" />
        </setdynvars>

        <setdynvars sourcetype="random_string" length="20">
          <var name="rnd_order_address" />
        </setdynvars>

        <setdynvars sourcetype="random_string" length="10">
          <var name="rnd_order_name" />
        </setdynvars>

        <setdynvars sourcetype="random_number" start="1" end="10">
          <var name="rnd_item_count" />
        </setdynvars>

        <request subst="true">
            <http url="/orders" 
                  version='1.1' 
                  method='POST' 
                  contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;order%5Border_no%5D=%%_rnd_order_no%%&amp;order%5Baddress%5D=%%_rnd_order_address%%&amp;order%5Bname%5D=%%_rnd_order_name%%&amp;order%5Bcount%5D=%%_rnd_item_count%%&amp;order%5Bdeal_id%5D=%%_rnd_deal%%&amp;order%5Buser_id%5D=%%_rnd_user%%&amp;commit=Make+an+Order" 
                  content_type="application/x-www-form-urlencoded"></http>
        </request>

        <!-- comment on the deal-->
        <thinktime value="2" random="true"></thinktime>

       <request subst="true">
            <dyn_variable name="authenticity_token"></dyn_variable>
            <http url="/deals/%%_rnd_deal%%" version='1.1' method='GET'></http>
       </request>

        <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
        <var name="authenticity_token" />
        </setdynvars>

        <setdynvars sourcetype="random_string" length="15">
          <var name="rnd_comment" />
        </setdynvars>

        <request subst="true">
            <http url="/comments" 
                  version='1.1' 
                  method='POST' 
                  contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;comment%5Bcontent%5D=%%_rnd_comment%%&amp;comment%5Bdeal_id%5D=%%_rnd_deal%%&amp;button=" 
                  content_type="application/x-www-form-urlencoded"></http>
        </request>



      </session>
      <!-- end -->

  	</sessions>

</tsung>